In [ ]:
# SQL Assignment

Question 1 : Explain the fundamental differences between DDL, DML, and DQL
commands in SQL. Provide one example for each type of command.

The fundamental difference lies in their purpose regarding the database structure and data manipulation:

**Command Type**

**DDL**-Data Definition Language

**Purpose**--Defines, modifies, and deletes the structure (schema) of the database objects.

**Example**--CREATE TABLE Products (...)

**Command Type**

**DML**--Data Manipulation Language

**Purpose**--Manages the data within the schema objects, including inserting, updating, and deleting records.

**Example**--INSERT INTO Products VALUES (...)

**Command Type**

**DQL**--Data Query Language

**Purpose**--Language	Used to retrieve data from the database. Often considered a subset of DML.

**Example**--SELECT * FROM Products

Question 2 : What is the purpose of SQL constraints? Name and describe three common types
of constraints, providing a simple scenario where each would be useful.

The purpose of SQL constraints is to enforce rules on the data columns in a table, ensuring data accuracy and integrity. They prevent invalid data from being entered into the database.

**Constraint**

**PRIMARY KEY**

Uniquely identifies each row in a table. It cannot contain NULL values.,

Simple Scenario

Used for CustomerID in the Customers table to ensure every customer has a unique identifier.

***FOREIGN KEY***

Establishes a link between two tables. It ensures that values in one table's column match values in another table's primary key.

Simple Scenario

"Used for CategoryID in the Products table to ensure every product is linked to a valid, existing category in the Categories table."

**NOT NULL**

Ensures that a column cannot have a NULL value. The column must always contain a value.

Simple Scenario

Used for ProductName in the Products table to guarantee that every product entry has a recorded name.

Question 3 : Explain the difference between LIMIT and OFFSET clauses in SQL. How
would you use them together to retrieve the third page of results, assuming each page
has 10 records?

LIMIT: Specifies the maximum number of rows the result set should return. It controls the size of the page.

OFFSET: Specifies the number of rows to skip from the beginning of the result set before starting to return rows. It controls the starting point of the page.

To retrieve the third page of results, assuming each page has 10 records:

Skip (OFFSET): You need to skip the first two pages. $2 \text{ pages} \times 10 \text{ records/page} = 20$ records.

Limit (LIMIT): The third page should contain exactly 10 records.

In [16]:
%%sql
SELECT column1, column2
FROM your_table
ORDER BY column1 -- Required for consistent paging
LIMIT 10       -- Retrieve 10 records (the size of the page)
OFFSET 20;     -- Skip the first 20 records (pages 1 and 2)

Traceback (most recent call last):
  File "/usr/local/lib/python3.12/dist-packages/sql/magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/usr/local/lib/python3.12/dist-packages/sql/connection.py", line 82, in set
    raise ConnectionError(
sql.connection.ConnectionError: Environment variable $DATABASE_URL not set, and no connect string given.

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [5]:
!pip install ipython-sql
%load_ext sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.12/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (3.16.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (2.0.44)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet>=1 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.15.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (75.2.0)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: decorator in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (3.0.52)
Requirement already satisfied: pygments in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (2.19.2)
Requirement already satisfied: backcall in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.2.1)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.12/dist-packages (from prettytable->ipython-sql) (0.2.14)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/local/lib/python3.12/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.5)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.12/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Downloading jedi-0.19.2-py2.py3-none-any.whl (1.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 18.1 MB/s eta 0:00:00
Installing collected packages: jedi
Successfully installed jedi-0.19.2

Question 4 : What is a Common Table Expression (CTE) in SQL, and what are its main
benefits? Provide a simple SQL example demonstrating its usage.

A Common Table Expression (CTE) is a temporary, named result set defined within the execution scope of a single SELECT, INSERT, UPDATE, or DELETE statement. It's essentially a temporary view that only exists for the duration of a single query.

Main Benefits:

Readability: It breaks down complex, multi-step queries into simpler, logical, and readable steps.

Modularity/Reusability: It allows you to define a query once and reference it multiple times within the main query.

Recursion: It enables the creation of recursive queries (which are useful for hierarchical data like organizational charts).

Simple SQL Example:

In [ ]:
%%sql
WITH CustomerOrderCounts AS (
    -- Define the CTE: Calculates the total number of orders per customer
    SELECT
        CustomerID,
        COUNT(OrderID) AS TotalOrders
    FROM
        Orders
    GROUP BY
        CustomerID
)
-- Main Query: Uses the result from the CTE
SELECT
    C.CustomerName,
    COC.TotalOrders
FROM
    Customers C
JOIN
    CustomerOrderCounts COC ON C.CustomerID = COC.CustomerID
WHERE
    COC.TotalOrders > 1;

In [23]:
%config SqlMagic.style = 'plain' # Set a valid display style for ipython-sql

Question 5 : Describe the concept of SQL Normalization and its primary goals. Briefly
explain the first three normal forms (1NF, 2NF, 3NF).

SQL Normalization is a systematic process of organizing the columns and tables of a relational database to minimize data redundancy (duplicate data) and improve data integrity.

Primary Goals:

Eliminate Redundant Data: Storing the same information multiple times is wasteful and prone to errors.

Ensure Data Dependency Makes Sense: Ensuring that data is stored logically, where only related data is stored together in a table.

Prevent Anomalies: Preventing insertion, update, and deletion anomalies (errors that occur when redundant data is modified inconsistently).

The First Three Normal Forms:

**Normal Form**

First Normal Form

**Abbreviation**

1NF

**Rule/Concept**

Eliminate Repeating Groups. Each column must contain only atomic (indivisible) values, and there must be no repeating groups of columns."

**Normal Form**

Second Normal Form

**Abbreviation**
2NF

**Rule/Concept**

Must be in 1NF AND all non-key attributes must be fully functionally dependent on the primary key. (Applies mainly to tables with composite keys).

**Normal Form**

Third Normal Form

**Abbreviation**

3NF

**Rule/Concept**

Must be in 2NF AND there should be no transitive dependency. No non-key attribute should be dependent on another non-key attribute.

Question 6 : Create a database named ECommerceDB and perform the following
tasks:
1. Create the following tables with appropriate data types and constraints:
● Categories
○ CategoryID (INT, PRIMARY KEY)
○ CategoryName (VARCHAR(50), NOT NULL, UNIQUE)
● Products
○ ProductID (INT, PRIMARY KEY)
○ ProductName (VARCHAR(100), NOT NULL, UNIQUE)
○ CategoryID (INT, FOREIGN KEY → Categories)
○ Price (DECIMAL(10,2), NOT NULL)
○ StockQuantity (INT)
● Customers
○ CustomerID (INT, PRIMARY KEY)
○ CustomerName (VARCHAR(100), NOT NULL)
○ Email (VARCHAR(100), UNIQUE)
○ JoinDate (DATE)
● Orders
○ OrderID (INT, PRIMARY KEY)
○ CustomerID (INT, FOREIGN KEY → Customers)
○ OrderDate (DATE, NOT NULL)
○ TotalAmount (DECIMAL(10,2))
2. Insert the following records into each table
● Categories
CategoryID Category Name
1 Electronics
2 Books
3 Home Goods
4 Apparel
● Products
ProductID ProductName CategoryID Price StockQuantity
101 Laptop Pro 1 1200.00 50
102 SQL
Handbook
2 45.50 200
103 Smart Speaker 1 99.99 150
104 Coffee Maker 3 75.00 80
105 Novel : The
Great SQL
2 25.00 120
106 Wireless
Earbuds
1 150.00 100
107 Blender X 3 120.00 60
108 T-Shirt Casual 4 20.00 300

Customers
CustomerID CustomerName Email Joining Date
1 Alice Wonderland alice@example.com 2023-01-10
2 Bob the Builder bob@example.com 2022-11-25
3 Charlie Chaplin charlie@example.com 2023-03-01
4 Diana Prince diana@example.com 2021-04-26
● Orders
OrderID CustomerID OrderDate TotalAmount
1001 1 2023-04-26 1245.50
1002 2 2023-10-12 99.99
1003 1 2023-07-01 145.00
1004 3 2023-01-14 150.00
1005 2 2023-09-24 120.00
1006 1 2023-06-19 20.00

In [ ]:
%%sql sqlite://

-- 2. Create the Categories Table
CREATE TABLE Categories (
    CategoryID INT PRIMARY KEY,
    CategoryName VARCHAR(50) NOT NULL UNIQUE
);

-- 3. Create the Customers Table
CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100) NOT NULL,
    Email VARCHAR(100) UNIQUE,
    JoinDate DATE
);

-- 4. Create the Products Table (requires Categories to exist first)
CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100) NOT NULL UNIQUE,
    CategoryID INT,
    Price DECIMAL(10, 2) NOT NULL,
    StockQuantity INT,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

-- 5. Create the Orders Table (requires Customers to exist first)
CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10, 2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

-- ********** DATA INSERTION **********

-- 6. Insert into Categories
INSERT INTO Categories (CategoryID, CategoryName) VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');

-- 7. Insert into Products
INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel : The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);

-- 8. Insert into Customers
INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');

-- 9. Insert into Orders
INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);

Question 7 : Generate a report showing CustomerName, Email, and the
TotalNumberofOrders for each customer. Include customers who have not placed
any orders, in which case their TotalNumberofOrders should be 0. Order the results
by CustomerName.

This query uses a LEFT JOIN to ensure all customers are included, even those with no matching orders, and uses the COUNT() aggregate function with COALESCE (or IFNULL) to handle the null counts.

In [ ]:
%%sql
SELECT
    C.CustomerName,
    C.Email,
    COALESCE(COUNT(O.OrderID), 0) AS TotalNumberofOrders -- COALESCE replaces NULL counts with 0
FROM
    Customers C
LEFT JOIN
    Orders O ON C.CustomerID = O.CustomerID
GROUP BY
    C.CustomerID, C.CustomerName, C.Email
ORDER BY
    C.CustomerName;

Question 8 : Retrieve Product Information with Category: Write a SQL query to
display the ProductName, Price, StockQuantity, and CategoryName for all
products. Order the results by CategoryName and then ProductName alphabetically

This query uses an INNER JOIN to link the Products and Categories tables and orders the results as requested.

In [ ]:
SELECT
    P.ProductName,
    P.Price,
    P.StockQuantity,
    C.CategoryName
FROM
    Products P
INNER JOIN
    Categories C ON P.CategoryID = C.CategoryID
ORDER BY
    C.CategoryName,
    P.ProductName;

Question 9 : Write a SQL query that uses a Common Table Expression (CTE) and a
Window Function (specifically ROW_NUMBER() or RANK()) to display the
CategoryName, ProductName, and Price for the top 2 most expensive products in
each CategoryName.

This query uses a CTE to apply the RANK() window function, which assigns a rank to products based on their price within each category partition.

In [ ]:
WITH RankedProducts AS (
    -- 1. Partition data by CategoryName and rank products by Price in descending order
    SELECT
        C.CategoryName,
        P.ProductName,
        P.Price,
        RANK() OVER (PARTITION BY C.CategoryName ORDER BY P.Price DESC) as PriceRank
    FROM
        Products P
    JOIN
        Categories C ON P.CategoryID = C.CategoryID
)
-- 2. Select the top 2 products (Rank 1 and 2) from each category
SELECT
    CategoryName,
    ProductName,
    Price
FROM
    RankedProducts
WHERE
    PriceRank <= 2
ORDER BY
    CategoryName, Price DESC;

Question 10 : You are hired as a data analyst by Sakila Video Rentals, a global movie
rental company. The management team is looking to improve decision-making by
analyzing existing customer, rental, and inventory data.
Using the Sakila database, answer the following business questions to support key strategic
initiatives.
Tasks & Questions:
1. Identify the top 5 customers based on the total amount they’ve spent. Include customer
name, email, and total amount spent.
2. Which 3 movie categories have the highest rental counts? Display the category name
and number of times movies from that category were rented.
3. Calculate how many films are available at each store and how many of those have
never been rented.
4. Show the total revenue per month for the year 2023 to analyze business seasonality.
5. Identify customers who have rented more than 10 times in the last 6 months

In [ ]:
SELECT
    C.first_name || ' ' || C.last_name AS CustomerName, -- Concatenate names
    C.email,
    SUM(P.amount) AS TotalAmountSpent
FROM
    customer C
JOIN
    payment P ON C.customer_id = P.customer_id
GROUP BY
    C.customer_id, CustomerName, C.email
ORDER BY
    TotalAmountSpent DESC
LIMIT 5;

In [ ]:
SELECT
    C.name AS CategoryName,
    COUNT(R.rental_id) AS RentalCount
FROM
    category C
JOIN
    film_category FC ON C.category_id = FC.category_id
JOIN
    inventory I ON FC.film_id = I.film_id
JOIN
    rental R ON I.inventory_id = R.inventory_id
GROUP BY
    C.name
ORDER BY
    RentalCount DESC
LIMIT 3;

In [ ]:
SELECT
    S.store_id,
    COUNT(I.inventory_id) AS TotalFilmsAvailable, -- Total distinct film inventory items at the store
    SUM(CASE WHEN R.rental_id IS NULL THEN 1 ELSE 0 END) AS NeverRentedCount
FROM
    store S
JOIN
    inventory I ON S.store_id = I.store_id
LEFT JOIN
    rental R ON I.inventory_id = R.inventory_id
GROUP BY
    S.store_id
ORDER BY
    S.store_id;

In [ ]:
SELECT
    STRFTIME('%Y-%m', P.payment_date) AS PaymentMonth, -- SQLite date format function (adjust for MySQL/Postgres)
    -- MONTH(P.payment_date) AS PaymentMonth, -- Use this for MySQL
    SUM(P.amount) AS MonthlyRevenue
FROM
    payment P
WHERE
    STRFTIME('%Y', P.payment_date) = '2023' -- Filter for the year 2023
    -- YEAR(P.payment_date) = 2023 -- Use this for MySQL
GROUP BY
    PaymentMonth
ORDER BY
    PaymentMonth;

In [ ]:
SELECT
    C.first_name || ' ' || C.last_name AS CustomerName,
    COUNT(R.rental_id) AS RentalCount
FROM
    customer C
JOIN
    rental R ON C.customer_id = R.customer_id
WHERE
    R.rental_date >= DATE('now', '-6 months') -- SQLite date arithmetic (adjust for other DBs)
    -- R.rental_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH) -- Use this for MySQL
GROUP BY
    C.customer_id, CustomerName
HAVING
    COUNT(R.rental_id) > 10
ORDER BY
    RentalCount DESC;